var p = 0;

var colors = ["#99CCCC", "#FF9999", "#996699", "#CCCC99", "#CC9999", "#CCCCFF", "#CCCCCC", "#FF9966", "#666666", "#99CC66", "#99CC99", "#CCCC00", "#990033", "#FFCC99", "#FFCC33", "#663300", "#CC9900", "#336699", "#339999", "#990066", "#999999", "#993399", "#FF6666", "#0066CC", "#336666", "#009966", "#99CC99", "#99CC99", "#660066", "#FF9900"];

var library = [{
    "poetry": "一叶舟轻，双桨鸿惊。水天清、影湛波平。鱼翻藻鉴，鹭点烟汀。过沙溪急，霜溪寒，月溪明。<br>重重似影，曲曲如屏。算当年、虚老严陵。君臣一梦，今古空名。但远山长，云山乱，晓山青。",
    "name": "——《行春子·过七里濑》"
}, {
    "poetry": "谁作桓伊三弄。惊破绿窗幽梦。新月与愁烟，满江天。<br>欲去又还不去。明日落花飞絮。飞絮送行舟，水东流。",
    "name": "——《昭君怨·金山送柳子玉瑾》"
}, {
    "poetry": "缥缈危楼紫翠间。良辰乐事古难全。感时怀旧独凄然。<br>璧月琼枝空夜夜，菊花人貌自年年。不知来岁与谁看",
    "name": "——《浣溪沙·菊节》"
}, {
    "poetry": "雨后春容清更丽。只有离人，幽恨终难洗。北固山前三面水。碧琼梳拥青螺髻。<br>一纸乡书来万里。问我何年，真个成归计。回首送春拚一醉。东风吹破千行泪",
    "name": "——《蝶恋花·京口得乡书》"
}, {
    "poetry": "轻云微月。二更酒醒船初发。孤城回望苍烟合。记得歌时，不记归时节。<br>巾偏扇坠藤床滑。觉来幽梦无人说。此生飘荡何时歇？家在西南，长作东南别。",
    "name": "——《醉落魄·离京口作》"
}, {
    "poetry": "回首乱山横。不见居人只见城。谁似临平山上塔，亭亭。迎客西来送客行。<br>归路晚风轻。一枕初寒梦不成。今夜残灯斜照处，荧荧。秋雨晴时泪不晴。",
    "name": "——《南乡子·送述古》"
}, {
    "poetry": "凉簟碧纱厨。一枕清风昼睡馀。卧听晚衙无个事，徐徐。读尽床头几卷书。<br>搔首赋归欤。自觉功名懒更疏。若问使君才与气，何如？占得人间一味愚。",
    "name": "——《南乡子·和杨元素》"
}, {
    "poetry": "十年生死两茫茫。不思量，自难忘。千里孤坟，无处话凄凉。纵使相逢应不识，尘满面，鬓如霜。<br>夜来幽梦忽还乡。小轩窗，正梳妆。相顾无言，惟有泪千行。料得年年肠断处，明月夜，短松岗。",
    "name": "——《江城子·乙卯正月二十日记梦》"
}, {
    "poetry": "今年春浅腊侵年。冰雪破春妍。东风有信无人见，露微意、柳际花边。寒夜纵长，孤衾易暖，钟鼓渐清圆。<br>朝来初日半衔山。楼阁淡疏烟。游人便作寻芳计，小桃杏、应以争先。衰病少悰，疏慵自放，惟爱日高眠。",
    "name": "——《一丛花·初春病起》"
}, {
    "poetry": "春未老，风细柳斜斜。试上超然台上望，半壕春水一城花。烟雨暗千家。<br>寒食后，酒醒却咨嗟。休对故人思故国，且将新火试新茶。诗酒趁年华。",
    "name": "——《望江南·超然台作》"
}, {
    "poetry": "忘却成都来十载，因君未免思量。凭将清泪洒江阳。故山知好在，孤客自悲凉。<br>坐上别愁君未见，归来欲断无肠。殷勤且更尽离觞。此身如传舍，何处是吾乡。",
    "name": "——《临江仙·送王缄》"
}, {
    "poetry": "照日深红暖见鱼。连溪绿暗晚藏乌。黄童白叟聚睢盱。<br>麋鹿逢人虽未惯，猿猱闻鼓不须呼。归家说与采桑姑。",
    "name": "——《浣溪沙》"
}, {
    "poetry": "蔌蔌衣巾落枣花。村南村北响缲车。牛衣古柳卖黄瓜。<br>酒困日长唯欲睡，日高人渴漫思茶。敲门试问野人家。",
    "name": "——《浣溪沙》"
}, {
    "poetry": "明月如霜，好风如水，清景无限。曲港跳鱼，圆荷泻露，寂寞无人见。紞如三鼓，铿然一叶，黯黯梦云惊断。夜茫茫，重寻无处，觉来小园行遍。<br>天涯倦客，山中归路，望断故园心眼。燕子楼空，佳人何在，空锁楼中燕。古今如何，何曾梦觉，但有旧欢新怨。异时对，黄楼夜景，为余浩叹。",
    "name": "——《永遇乐》"
}, {
    "poetry": "经旬未识东君信。一夕薰风来解愠。红绡衣薄麦秋寒，绿绮韵低梅雨润。<br>瓜头绿染山光嫩。弄色金桃新傅粉。日高慵卷水晶帘，犹带春醪红玉困。",
    "name": "——《木兰花令》"
}, {
    "poetry": "缺月挂疏桐，漏断人初静。谁见幽人独往来，缥缈孤鸿影。<br>惊起却回头，有恨无人省。拣尽寒枝不肯栖，寂寞沙洲冷。",
    "name": "——《卜算子·黄州定会院寓居作》"
}, {
    "poetry": "柳庭风静人眠昼。昼眠人静风庭柳。香汗薄衫凉。凉衫薄汗香。<br>手红冰碗藕。藕碗冰红手。郎笑藕丝长。长丝藕笑郎。",
    "name": "——《菩萨蛮·回文夏闺怨》"
}, {
    "poetry": "似花还似非花，也无人惜从教坠。抛家傍路，思量却是，无情有思。萦损柔肠，困酣娇眼，欲开还闭。梦随风万里，寻郎去处，又还被、莺呼起。<br>不恨此花飞尽，恨西园，落红难缀。晓来雨过，遗踪何在？一池萍碎。春色三分，二分尘土，一分流水。细看来，不是杨花，点点是离人泪。",
    "name": "——《水龙吟·次韵章质夫杨花词》"
}, {
    "poetry": "世事一场大梦，人生几度秋凉。夜来风叶已鸣廊，看取眉头鬓上。<br>酒贱常愁客少，月明多被云妨。中秋谁与共孤光，把盏凄然北望。",
    "name": "——《西江月·黄州中秋》"
}, {
    "poetry": "日薄花房绽，风和麦浪轻。夜来微雨洗郊埛。正是一年春好、近清明。<br>已改煎茶火，犹调入粥饧。使君高会有余清。此乐无声无味、最难名。",
    "name": "——《南歌子·晚春》"
}, {
    "poetry": "莫听穿林打叶声。何妨吟啸且徐行。竹杖芒鞋轻胜马。谁怕？一蓑烟雨任平生。<br>料峭春风吹酒醒。微冷。山头斜照却相迎。回首向来萧瑟处。归去。也无风雨也无晴。",
    "name": "——《定风波》"
}, {
    "poetry": "江汉西来，高楼下、蒲萄深碧。犹自带、岷峨雪浪，锦江春色。君是南山遗爱守，我为剑外思归客。对此间、风物岂无情，殷勤说。江表传，君休读。狂处士，真堪惜。空洲对鹦鹉，苇花萧瑟。独笑书生争底事，曹公黄祖俱飘忽。愿使君、还赋谪仙诗，追黄鹤。",
    "name": "——《满江红·寄鄂州朱使君寿昌》"
}, {
    "poetry": "冰肌玉骨，自清凉无汗。水殿风来暗香满。绣帘开，一点明月窥人，人未寝，欹枕钗横云鬓乱。起来携素手，庭户无声，时见疏星度河汉。试问夜如何？夜已三更，金波淡，玉绳低转。但屈指、西风几时来，又不道流年，暗中偷换。",
    "name": "——《洞仙歌》"
}, {
    "poetry": "凭高眺远，见长空万里，云无留迹。桂魄飞来光射处，冷浸一天秋碧。玉宇琼楼，乘鸾来去，人在清凉国。江山如画，望中烟树历历。<br>我醉拍手狂歌，举杯邀月，对影成三客。起舞徘徊风露下，今夕不知何夕。便欲乘风，翻然归去，何用骑鹏翼。水晶宫里，一声吹断横笛。",
    "name": "——《念奴娇·中秋》"
}, {
    "poetry": "夜饮东坡醒复醉，归来仿佛三更。家童鼻息已雷鸣，敲门都不应，倚杖听江声。<br>长恨此身非我有，何时忘却营营。夜阑风静縠纹平。小舟从此逝，江海寄余生。",
    "name": "——《临江仙·夜归临皋》"
}, {
    "poetry": "林断山明竹隐墙。乱蝉衰草小池塘。翻空白鸟时时见，照水红蕖细细香。<br>村舍外，古城旁。杖藜徐步转斜阳。殷勤昨夜三更雨，又得浮生一日凉。",
    "name": "——《鹧鸪天》"
}, {
    "poetry": "绿槐高柳咽新蝉。熏风初入弦。碧纱窗下水沉烟。棋声惊昼眠<br>微雨过，小荷翻。榴花开欲然。玉盆纤手弄清泉。琼珠碎却圆。",
    "name": "——《阮郎归·初夏》"
}, {
    "poetry": "波声拍枕长淮晓。隙月窥人小。无情汴水自东流，只载一船离恨向西州。<br>竹溪花浦曾同醉。酒味多于泪。谁教风鉴在尘埃。酝造一场烦恼送人来。",
    "name": "——《虞美人》"
}, {
    "poetry": "三十三年，漂流江海，万里烟浪云帆。故人惊怪，憔悴老青衫。我自疏狂异趣，君何事、奔走尘凡？流年尽，穷途坐守，船尾冻相衔。<br>巉巉。淮浦外，层楼翠壁，古寺空岩。步携手林间，笑挽纤纤。莫上孤峰尽处，萦望眼、云海相搀。家何在？因君问我，归梦绕松杉。",
    "name": "——《满庭芳》"
}, {
    "poetry": "如烟飞花舞。悄无人、桐阴转午，晚凉新浴。手弄生绡白团扇，扇手一时如玉。渐困倚、孤眠清熟。帘外谁来推绣户，枉教人、梦断瑶台曲。又却是、风敲竹。<br>石榴半吐红巾蹙，待浮花、浪蕊都尽，伴君幽独。秾艳一枝细看取，芳心千重似束。又恐被、西风惊绿。若待得君来向此，花前对酒不忍触。共粉泪，两簌簌。",
    "name": "——《贺新郎·夏景》"
}];

$(document).ready(function() {
    randomQuote(p);
    $("button").click(function() {
        $(".background").fadeToggle(2000);
       
        if (p == 0) {
            p = 1;
        } else {
            p = 0;
        }
        randomQuote(p);
    });
    $(".fa-weibo").click(function() {
        $("button").html("weibo");
        shareToWeibo();
    });
    $(".fa-facebook-square").click(function() {
        shareToFacebook();
    });
});

function randomQuote(p) {
    var poetryIndex = Math.floor(Math.random() * 15);
    var colorIndex = Math.floor(Math.random() * 15);
    /*
    if (p == 0) {
        $(".background").css("background-color", colors[colorIndex]);
    } else {
        $(".container").css("background-color", colors[colorIndex]);
    }
     */
    
    $(".container").css("background-color", colors[colorIndex]);
    
    $("#name").fadeOut(1000);
    $("output").fadeOut(1000, function() {
        $("output").fadeIn(1000)
            .css("color", colors[colorIndex])
            .html(library[poetryIndex].poetry);
        $("#name").fadeIn(1000)
            .css("color", colors[colorIndex])
            .html(library[poetryIndex].name);
        $("button").css("background-color", colors[colorIndex]);
        $(".fa").css("color", colors[colorIndex]);
    });
}

function shareToFacebook() {
    $("button").html("facebook");
    /* 加载和初始化 JavaScript 版 Facebook SDK */
    window.fbAsyncInit = function() {
        FB.init({
            appId: '378540049192954',
            xfbml: false,
            version: 'v2.8'
        });
        FB.getLoginStatus(function(response) {
            if (response.status === "connected") {
                alert("Aloha!");
                FB.ui({
                        method: "share",
                        hashtag: "random_quote_machine",
                        quote: library[poetryIndex].poetry + " " + library[poetryIndex].name
                    },
                    function(response) {
                        if (response && !response.error_massage) {
                            alert("分享成功！");
                        } else {
                            alert("很抱歉，分享出了点儿小问题！\n 过会儿再试试吧！");
                        }
                    });
            } else {
                alert("未登录");
            }
        });
        FB.AppEvents.logPageView();

    };

    (function(d, s, id) {
        var js, fjs = d.getElementsByTagName(s)[0];
        if (d.getElementById(id)) {
            return; }
        js = d.createElement(s);
        js.id = id;
        js.src = "//connect.facebook.net/zh_CN/sdk.js";
        fjs.parentNode.insertBefore(js, fjs);
    }(document, 'script', 'facebook-jssdk'));
}
